# Оберіть будь-які 4 таски з попередніх домашніх робіт та
# перетворіть їх у 4 функції, що отримують значення та повертають результат.
# Обоязково документуйте функції та дайте зрозумілі імена змінним.

# Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є літера "h" (враховуються як великі так і маленькі).
# Цикл не повинен завершитися, якщо користувач ввів слово без букви "h".

def word_with_h():
    '''
    :return: str, word with h or H
    '''
    while 'h' not in (slovo := input('Введи слово з H або h: ')).lower():
        print('Не вийшло, спробуй ще')
    return f'Слово містить h або H: {slovo}'

print(word_with_h())